---
kind: other
id: Properties.T:Autodesk.Revit.DB.ElementIsCurveDrivenFilter
source: html/6e39a274-87b8-2cec-0891-e4e96807deb8.htm
---
# ElementIsCurveDrivenFilter Properties

True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected,
 and elements that would normally be rejected will be accepted.